# -*- coding: utf-8 -*-
from googletrans import Translator
import MySQLdb



translator = Translator()


# a = translator.translate('චීන කොමියුනිස්ට් පක්ෂයේ 19 වැනි ජාතික නියෝජිත සම්මේලනය අද බෙයිජිංහිදී ආරම්භ විය. චීන කොමියුනිස්ට් පක්ෂයේ මධ්‍යම කාරක සභාවේ මහ ලේකම් ෂී ජින්පිං මහතා චීන කොමියුනිස්ට් පක්ෂයේ 18 වැනි මධ්‍යම කාරක සභාව නියෝජනය කරමින් මෙවර සම්මේලනය වෙත දේශපාලන වාර්තාවක් ඉදිරිපත් කළේය. චීන ලක්ෂණයන්ගෙන් යුතු සමාජවාදය නව යුගයකට පිවිස තිබෙන බව ඔහු එහිදී ප්‍රකාශ කළේය. චීන කොමියුනිස්ට් පක්ෂය චීන ජනතාව මෙහෙයවා, සුවපහසු සමාජයක් ගොඩනගමින් මෙම සියවසේ මැද භාගය වන විට සමෘද්ධිමත්,ශක්තිමත්, ප්‍රජාතාන්ත්‍රික, ශිෂ්ටාචාරත්මක, සුසංගත හා අලංකාර නවීකරණ සමාජවාදී බලවත් රටක් නිර්මාණය කරමින් චීන ජනතාවගේ ශ්‍රේෂ්ඨ පුනර්ජීවන සිහිනය සාක්ෂාත් කර ගනු ඇතැයි ද හෙතෙම සඳහන් කළේය.')
# print a


# a = translator.translate('මෙරට ජනගහණයෙන් 70%ක් සම්පූර්ණයෙන් ම මධ්‍යසාර භාවිතයෙන් තොර බව හෙළි වෙයි.')
a = translator.translate(' ජනගහණය')

print a